app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
---
  <%binding.pry%>
    <%= select_tag "author", options_from_collection_for_select(Author.all, "id", "name"), include_blank: true %>